Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омКомментарииНаСервере/Ext/Module.bsl
Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент, ВсеКомментарии = Истина) Экспорт
	
	ЭлементГруппа 		= СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент);
	ЭлементГруппаКнопки = СоздатьГруппуКнопки(ТекущаяФорма, ЭлементГруппа);
	СоздадьКомандуДобавитьКомментарий(ТекущаяФорма);
	СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппаКнопки);
	Если ВсеКомментарии Тогда
		СоздадьКомандуВсеКомментарии(ТекущаяФорма);
		СоздатьКнопкуВсеКомментарии(ТекущаяФорма, ЭлементГруппаКнопки);
	КонецЕсли;
	
	ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
КонецПроцедуры 

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа)
	
	НовыйЭлемент 				= ТекущаяФорма.Элементы.Добавить("Комментарий_авто", Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок		= "Комментарий";
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеHTMLДокумента;
	НовыйЭлемент.ПутьКДанным 	= ИмяРеквизита;
	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)

Функция СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

	имяРеквизита = "Комментарий_авто";
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат имяРеквизита;
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Функция СоздатьГруппуКнопки(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКомментарийКнопки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Функция СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКомментарий_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Функция СоздадьКомандуВсеКомментарии(ТекущаяФорма)
	
	КомандаВсеКомментарии 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаВсеКомментарии");
	КомандаВсеКомментарии.Заголовок 	= "Все комментарии";
	КомандаВсеКомментарии.Действие 		= "ОбщаяКомандаВсеКомментарии";
	
	Возврат КомандаВсеКомментарии;
	
КонецФункции

Функция СоздадьКомандуДобавитьКомментарий(ТекущаяФорма)
	
	КомандаДобавитьКомментарий 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКомментарий");
	КомандаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КомандаДобавитьКомментарий.Действие 	= "ОбщаяКомандаКомментарий";
	
	Возврат КомандаДобавитьКомментарий;
	
КонецФункции

Процедура СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаДобавитьКомментарий", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаКомментарий";
	
КонецПроцедуры

Процедура СоздатьКнопкуВсеКомментарии(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаВсеКомментарии", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Все комментарии";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаВсеКомментарии"; 
	КнопкаДобавитьКомментарий.Пометка		= Истина;
	
КонецПроцедуры

//Колонки ДанныеКомментария Автор, Дата, Текст, ТипКомментария
Функция Получить_HTML_комментарий(ОбъектВывода, ОтображатьТип = Ложь, СтрокаСортировки = "", ДополнительныеПараметры = Неопределено, ВсеКомментарии = Ложь) Экспорт
	
	ДополнительныеПараметры = Новый Структура("КоличествоКомментариев, КрайняяДата", 0, Дата(1, 1, 1)); 
		
	Если ВсеКомментарии Тогда
		
		Возврат СформироватьВсеКомментарии(ОбъектВывода, ОтображатьТип, СтрокаСортировки, ДополнительныеПараметры);
		
	КонецЕсли;
	
	ДополнительныеПараметры.КоличествоКомментариев = ОбъектВывода.Количество();

	Возврат СформироватьКомментарийОбъекта(ОбъектВывода, ОтображатьТип, СтрокаСортировки, ДополнительныеПараметры);
	
КонецФункции // Получить_HTML_комментарий()

Функция СформироватьВсеКомментарии(ОбъектВывода, ОтображатьТип, СтрокаСортировки, ДополнительныеПараметры)

	ЭтоКомпозиция = Ложь;
	ОбъектТЗ = ПолучитьОбъектТЗ(ОбъектВывода, ЭтоКомпозиция);
	
	ТаблицаДанных = ПолучитьТаблицуДанных(ОбъектТЗ); 
	
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 3);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Текст</th><th style=""min-width: 65px;"">Автор</th><th style=""min-width: 95px;"">Источник</th>";
	
	ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		ТестСообщения = омHTML.ЗаменитьЗапрещеныеСммволы(СтрокаТаблицы.Текст);

		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор, СтрокаТаблицы.Представление);	
		
		Если СтрокаТаблицы.Дата > ДополнительныеПараметры.КрайняяДата Тогда
			ДополнительныеПараметры.КрайняяДата = СтрокаТаблицы.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;

КонецФункции // СформироватьВсеКомментарии()

Функция ПолучитьТаблицуДанных(ОбъектТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектКомментарии.Ссылка КАК Ссылка,
		|	ИзделияКомплектКомментарии.Автор КАК Автор,
		|	ИзделияКомплектКомментарии.Дата КАК Дата,
		|	ИзделияКомплектКомментарии.Текст КАК Текст,
		|	ИзделияКомплектКомментарии.ТипКомментария КАК ТипКомментария,
		|	ТИПЗНАЧЕНИЯ(ИзделияКомплектКомментарии.Ссылка) КАК Представление
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект.Комментарии КАК ИзделияКомплектКомментарии
		|ГДЕ
		|	ИзделияКомплектКомментарии.Ссылка = &ОбъектТЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПересогласованиеКомпозицииКомментарии.Ссылка,
		|	ПересогласованиеКомпозицииКомментарии.Автор,
		|	ПересогласованиеКомпозицииКомментарии.Дата,
		|	ПересогласованиеКомпозицииКомментарии.Текст,
		|	ПересогласованиеКомпозицииКомментарии.ТипКомментария,
		|	ТИПЗНАЧЕНИЯ(ПересогласованиеКомпозицииКомментарии.Ссылка)
		|ИЗ
		|	Задача.ПересогласованиеКомпозиции.Комментарии КАК ПересогласованиеКомпозицииКомментарии
		|ГДЕ
		|	ПересогласованиеКомпозицииКомментарии.Ссылка.ОбъектТЗ = &ОбъектТЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_ПКДКомментарии.Ссылка,
		|	Задачи_ПКДКомментарии.Автор,
		|	Задачи_ПКДКомментарии.Дата,
		|	Задачи_ПКДКомментарии.Текст,
		|	Задачи_ПКДКомментарии.ТипКомментария,
		|	ТИПЗНАЧЕНИЯ(Задачи_ПКДКомментарии.Ссылка)
		|ИЗ
		|	Задача.Задачи_ПКД.Комментарии КАК Задачи_ПКДКомментарии
		|ГДЕ
		|	Задачи_ПКДКомментарии.Ссылка.ОбъектТЗ = &ОбъектТЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПринятьТЗКомментарии.Ссылка,
		|	ПринятьТЗКомментарии.Автор,
		|	ПринятьТЗКомментарии.Дата,
		|	ПринятьТЗКомментарии.Текст,
		|	ПринятьТЗКомментарии.ТипКомментария,
		|	ТИПЗНАЧЕНИЯ(ПринятьТЗКомментарии.Ссылка)
		|ИЗ
		|	Задача.ПринятьТЗ.Комментарии КАК ПринятьТЗКомментарии
		|ГДЕ
		|	ПринятьТЗКомментарии.Ссылка.ОбъектТЗ = &ОбъектТЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_РКДКомментарии.Ссылка,
		|	Задачи_РКДКомментарии.Автор,
		|	Задачи_РКДКомментарии.Дата,
		|	Задачи_РКДКомментарии.Текст,
		|	Задачи_РКДКомментарии.ТипКомментария,
		|	ТИПЗНАЧЕНИЯ(Задачи_РКДКомментарии.Ссылка)
		|ИЗ
		|	Задача.Задачи_РКД.Комментарии КАК Задачи_РКДКомментарии
		|ГДЕ
		|	Задачи_РКДКомментарии.Ссылка.ОбъектТЗ = &ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Ссылка КАК Ссылка,
		|	вт.Автор КАК Автор,
		|	вт.Дата КАК Дата,
		|	вт.Текст КАК Текст,
		|	вт.ТипКомментария КАК ТипКомментария,
		|	вт.Представление КАК Представление
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуДанных(ОбъектТЗ)

Функция ПолучитьОбъектТЗ(ОбъектВывода, ЭтоКомпозиция)
	
	ТипОбъектаВывода = ТипЗнч(ОбъектВывода);
	
	Если ТипОбъектаВывода = Тип("ЗадачаСсылка.Задачи_ПКД") ИЛИ ТипОбъектаВывода = Тип("ЗадачаСсылка.Задачи_РКД") ИЛИ ТипОбъектаВывода = Тип("ЗадачаСсылка.ПринятьТЗ") Тогда
		ОбъектТЗ = ОбъектВывода.ОбъектТЗ;	
	ИначеЕсли ТипОбъектаВывода = Тип("СправочникСсылка.ИзделияКомплект") ИЛИ ТипОбъектаВывода = Тип("СправочникСсылка.Композиции") Тогда
		ОбъектТЗ = ОбъектВывода;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоКомпозиция = ТипЗнч(ОбъектТЗ) = Тип("СправочникСсылка.Композиции");
	
	Возврат ОбъектТЗ;

КонецФункции // ПолучитьОбъектТЗ()

Функция СформироватьКомментарийОбъекта(ДанныеКомментария, ОтображатьТип, СтрокаСортировки, ДополнительныеПараметры)

	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		ДанныеКомментария.Сортировать(СтрокаСортировки);	
	КонецЕсли;
		
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 3);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Текст</th><th style=""min-width: 65px;"">Автор</th>";
	
	Если ОтображатьТип Тогда
		стрВозврата = стрВозврата + "<th>Тип</th></tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	Иначе
		стрВозврата = стрВозврата + "</tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ДанныеКомментария Цикл
		
		ТестСообщения = омHTML.ЗаменитьЗапрещеныеСммволы(СтрокаТаблицы.Текст);

		Если ОтображатьТип Тогда
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор, СтрокаТаблицы.ТипКомментария);	
		Иначе
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор);	
		КонецЕсли; 
		
		Если СтрокаТаблицы.Дата > ДополнительныеПараметры.КрайняяДата Тогда
			ДополнительныеПараметры.КрайняяДата = СтрокаТаблицы.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;

КонецФункции // СформироватьКомментарийОбъекта()
